app/Http/Controllers/User/DevisController.php

        //     // ->whereIn('formules.teeth', $tooth[0])
        //     ->select('lignedevis.*', DB::raw("actes.nom as act"), 'formules.coord', 'formules.color')
        //     ->get();
        $lignes = LigneDevis::with('act', 'coord')->whereIn('id', $ids)->get();
---
select * from `lignedevis` where `id` in (166, 167)