app/Http/Controllers/User/PatientController.php

    private function getPatient($id)
    {
        return Patient::with(
            'prescriptions',
            'appointements.assignedTo',
            'appointements.category',
            'antecedents',
            'radios',
            'pathologies',
            'lastSchema.lastQuotation.linesInProgress.act',
            'lastSchema.lastQuotation.linesDone.act',
            'lastSchema.lastQuotation.linesInProgress.coord',
            'lastSchema.lastQuotation.crediteur',
            'lastSchema.lastQuotation.lastPayment',
            'lastSchema.lastQuotation.payments',
            'initialSchema.traitements'
        )->find($id);
---
select * from `schemas` where `schemas`.`patient_id` in (59) order by `created_at` desc limit 1