app/Http/Controllers/User/PatientController.php

select * from `patients`
---
    public function index()
    {

        // if (Auth::user()->cant('patients.view')) return redirect()->back();

        $patients = Patient::all();

select * from `patients`
---
    public function getPatients()
    {

        // if (Auth::user()->cant('patients.view')) return redirect()->back();

        $patients = Patient::all();

select * from `pathologies`
---
    public function getPathologies()
    {
        return DB::table('pathologies')->get();

select * from `antecedents`
---
    public function getAntecedents()
    {
        return DB::table('antecedents')->get();

select * from `patients` where `patients`.`id` = '59' limit 1
select * from `prescriptions` where `type` = 'prescription' and `prescriptions`.`patient_id` in (59)
select * from `radios` where `radios`.`patient_id` in (59)
select * from `pathologie_patient` inner join `pathologies` on `pathologies`.`id` = `pathologie_patient`.`pathologie_id` where `patient_id` = '59'
select * from `antecedent_patient` inner join `antecedents` on `antecedents`.`id` = `antecedent_patient`.`antecedent_id` where `patient_id` = '59'
---
    public function show($id)
    {
        $patient = Patient::with('radios','prescriptions')->find($id);
        $pathologies = DB::table('pathologie_patient')->join('pathologies','pathologies.id','pathologie_patient.pathologie_id')->where('patient_id',$id)->get();
        $antecedents = DB::table('antecedent_patient')->join('antecedents','antecedents.id','antecedent_patient.antecedent_id')->where('patient_id',$id)->get();

select * from `patients` where `patients`.`id` = '59' limit 1
select `antecedents`.*, `antecedent_patient`.`patient_id` as `pivot_patient_id`, `antecedent_patient`.`antecedent_id` as `pivot_antecedent_id` from `antecedents` inner join `antecedent_patient` on `antecedents`.`id` = `antecedent_patient`.`antecedent_id` where `antecedent_patient`.`patient_id` in (59)
select `pathologies`.*, `pathologie_patient`.`patient_id` as `pivot_patient_id`, `pathologie_patient`.`pathologie_id` as `pivot_pathologie_id` from `pathologies` inner join `pathologie_patient` on `pathologies`.`id` = `pathologie_patient`.`pathologie_id` where `pathologie_patient`.`patient_id` in (59)
---
    private function getPatient($id) {
        return response()->json(Patient::with('antecedents','pathologies')->find($id) , 200);