app/Http/Controllers/Admin/ActController.php

    public function getActs()
    {
        return Category::with('acts')->get();
---
select * from `categories`